ashleyjwood/CC2511/Lab04/rp2040-cmsis-1.h
// generated by python3 svd.py
#pragma once
typedef __UINT32_TYPE__ uint32_t;
#define REG(addr) *(volatile uint32_t*)(addr)
#define __IO volatile



typedef struct
{
	__IO uint32_t CTRL;	// off 0x0000
	__IO uint32_t FLUSH;	// off 0x0004
	__IO uint32_t STAT;	// off 0x0008
	__IO uint32_t CTR_HIT;	// off 0x000c
	__IO uint32_t CTR_ACC;	// off 0x0010
	__IO uint32_t STREAM_ADDR;	// off 0x0014
	__IO uint32_t STREAM_CTR;	// off 0x0018
	__IO uint32_t STREAM_FIFO;	// off 0x001c
} XIP_CTRL_TypeDef;
#define XIP_CTRL_BASE 0x14000000
#define XIP_CTRL ((XIP_CTRL_TypeDef *) XIP_CTRL_BASE)

typedef struct
{
	__IO uint32_t CTRLR0;	// off 0x0000
	__IO uint32_t CTRLR1;	// off 0x0004
	__IO uint32_t SSIENR;	// off 0x0008
	__IO uint32_t MWCR;	// off 0x000c
	__IO uint32_t SER;	// off 0x0010
	__IO uint32_t BAUDR;	// off 0x0014
	__IO uint32_t TXFTLR;	// off 0x0018
	__IO uint32_t RXFTLR;	// off 0x001c
	__IO uint32_t TXFLR;	// off 0x0020
	__IO uint32_t RXFLR;	// off 0x0024
	__IO uint32_t SR;	// off 0x0028
	__IO uint32_t IMR;	// off 0x002c
	__IO uint32_t ISR;	// off 0x0030
	__IO uint32_t RISR;	// off 0x0034
	__IO uint32_t TXOICR;	// off 0x0038
	__IO uint32_t RXOICR;	// off 0x003c
	__IO uint32_t RXUICR;	// off 0x0040
	__IO uint32_t MSTICR;	// off 0x0044
	__IO uint32_t ICR;	// off 0x0048
	__IO uint32_t DMACR;	// off 0x004c
	__IO uint32_t DMATDLR;	// off 0x0050
	__IO uint32_t DMARDLR;	// off 0x0054
	__IO uint32_t IDR;	// off 0x0058
	__IO uint32_t SSI_VERSION_ID;	// off 0x005c
	__IO uint32_t DR0;	// off 0x0060
	__IO uint32_t _pad0[35]; 
	__IO uint32_t RX_SAMPLE_DLY;	// off 0x00f0
	__IO uint32_t SPI_CTRLR0;	// off 0x00f4
	__IO uint32_t TXD_DRIVE_EDGE;	// off 0x00f8
} XIP_SSI_TypeDef;
#define XIP_SSI_BASE 0x18000000
#define XIP_SSI ((XIP_SSI_TypeDef *) XIP_SSI_BASE)

typedef struct
{
	__IO uint32_t CHIP_ID;	// off 0x0000
	__IO uint32_t PLATFORM;	// off 0x0004
	__IO uint32_t _pad0[14]; 
	__IO uint32_t GITREF_RP2040;	// off 0x0040
} SYSINFO_TypeDef;
#define SYSINFO_BASE 0x40000000
#define SYSINFO ((SYSINFO_TypeDef *) SYSINFO_BASE)

typedef struct
{
	__IO uint32_t PROC0_NMI_MASK;	// off 0x0000
	__IO uint32_t PROC1_NMI_MASK;	// off 0x0004
	__IO uint32_t PROC_CONFIG;	// off 0x0008
	__IO uint32_t PROC_IN_SYNC_BYPASS;	// off 0x000c
	__IO uint32_t PROC_IN_SYNC_BYPASS_HI;	// off 0x0010
	__IO uint32_t DBGFORCE;	// off 0x0014
	__IO uint32_t MEMPOWERDOWN;	// off 0x0018
} SYSCFG_TypeDef;
#define SYSCFG_BASE 0x40004000
#define SYSCFG ((SYSCFG_TypeDef *) SYSCFG_BASE)

typedef struct
{
	__IO uint32_t CLK_GPOUT0_CTRL;	// off 0x0000
	__IO uint32_t CLK_GPOUT0_DIV;	// off 0x0004
	__IO uint32_t CLK_GPOUT0_SELECTED;	// off 0x0008
	__IO uint32_t CLK_GPOUT1_CTRL;	// off 0x000c
	__IO uint32_t CLK_GPOUT1_DIV;	// off 0x0010
	__IO uint32_t CLK_GPOUT1_SELECTED;	// off 0x0014
	__IO uint32_t CLK_GPOUT2_CTRL;	// off 0x0018
	__IO uint32_t CLK_GPOUT2_DIV;	// off 0x001c
	__IO uint32_t CLK_GPOUT2_SELECTED;	// off 0x0020
	__IO uint32_t CLK_GPOUT3_CTRL;	// off 0x0024
	__IO uint32_t CLK_GPOUT3_DIV;	// off 0x0028
	__IO uint32_t CLK_GPOUT3_SELECTED;	// off 0x002c
	__IO uint32_t CLK_REF_CTRL;	// off 0x0030
	__IO uint32_t CLK_REF_DIV;	// off 0x0034
	__IO uint32_t CLK_REF_SELECTED;	// off 0x0038
	__IO uint32_t CLK_SYS_CTRL;	// off 0x003c
	__IO uint32_t CLK_SYS_DIV;	// off 0x0040
	__IO uint32_t CLK_SYS_SELECTED;	// off 0x0044
	__IO uint32_t CLK_PERI_CTRL;	// off 0x0048
	__IO uint32_t _pad0; 
	__IO uint32_t CLK_PERI_SELECTED;	// off 0x0050
	__IO uint32_t CLK_USB_CTRL;	// off 0x0054
	__IO uint32_t CLK_USB_DIV;	// off 0x0058
	__IO uint32_t CLK_USB_SELECTED;	// off 0x005c
	__IO uint32_t CLK_ADC_CTRL;	// off 0x0060
	__IO uint32_t CLK_ADC_DIV;	// off 0x0064
	__IO uint32_t CLK_ADC_SELECTED;	// off 0x0068
	__IO uint32_t CLK_RTC_CTRL;	// off 0x006c
	__IO uint32_t CLK_RTC_DIV;	// off 0x0070
	__IO uint32_t CLK_RTC_SELECTED;	// off 0x0074
	__IO uint32_t CLK_SYS_RESUS_CTRL;	// off 0x0078
	__IO uint32_t CLK_SYS_RESUS_STATUS;	// off 0x007c
	__IO uint32_t FC0_REF_KHZ;	// off 0x0080
	__IO uint32_t FC0_MIN_KHZ;	// off 0x0084
	__IO uint32_t FC0_MAX_KHZ;	// off 0x0088
	__IO uint32_t FC0_DELAY;	// off 0x008c
	__IO uint32_t FC0_INTERVAL;	// off 0x0090
	__IO uint32_t FC0_SRC;	// off 0x0094
	__IO uint32_t FC0_STATUS;	// off 0x0098
	__IO uint32_t FC0_RESULT;	// off 0x009c
	__IO uint32_t WAKE_EN0;	// off 0x00a0
	__IO uint32_t WAKE_EN1;	// off 0x00a4
	__IO uint32_t SLEEP_EN0;	// off 0x00a8
	__IO uint32_t SLEEP_EN1;	// off 0x00ac
	__IO uint32_t ENABLED0;	// off 0x00b0
	__IO uint32_t ENABLED1;	// off 0x00b4
	__IO uint32_t INTR;	// off 0x00b8
	__IO uint32_t INTE;	// off 0x00bc
	__IO uint32_t INTF;	// off 0x00c0
	__IO uint32_t INTS;	// off 0x00c4
} CLOCKS_TypeDef;
#define CLOCKS_BASE 0x40008000
#define CLOCKS ((CLOCKS_TypeDef *) CLOCKS_BASE)

typedef struct
{
	__IO uint32_t RESET;	// off 0x0000
	__IO uint32_t WDSEL;	// off 0x0004
	__IO uint32_t RESET_DONE;	// off 0x0008
} RESETS_TypeDef;
#define RESETS_BASE 0x4000c000
#define RESETS ((RESETS_TypeDef *) RESETS_BASE)

typedef struct
{
	__IO uint32_t FRCE_ON;	// off 0x0000
	__IO uint32_t FRCE_OFF;	// off 0x0004
	__IO uint32_t WDSEL;	// off 0x0008
	__IO uint32_t DONE;	// off 0x000c
} PSM_TypeDef;
#define PSM_BASE 0x40010000
#define PSM ((PSM_TypeDef *) PSM_BASE)

typedef struct
{
	__IO uint32_t GPIO0_STATUS;	// off 0x0000
	__IO uint32_t GPIO0_CTRL;	// off 0x0004
	__IO uint32_t GPIO1_STATUS;	// off 0x0008
	__IO uint32_t GPIO1_CTRL;	// off 0x000c
	__IO uint32_t GPIO2_STATUS;	// off 0x0010
	__IO uint32_t GPIO2_CTRL;	// off 0x0014
	__IO uint32_t GPIO3_STATUS;	// off 0x0018
	__IO uint32_t GPIO3_CTRL;	// off 0x001c
	__IO uint32_t GPIO4_STATUS;	// off 0x0020
	__IO uint32_t GPIO4_CTRL;	// off 0x0024
	__IO uint32_t GPIO5_STATUS;	// off 0x0028
	__IO uint32_t GPIO5_CTRL;	// off 0x002c
	__IO uint32_t GPIO6_STATUS;	// off 0x0030
	__IO uint32_t GPIO6_CTRL;	// off 0x0034
	__IO uint32_t GPIO7_STATUS;	// off 0x0038
	__IO uint32_t GPIO7_CTRL;	// off 0x003c
	__IO uint32_t GPIO8_STATUS;	// off 0x0040
	__IO uint32_t GPIO8_CTRL;	// off 0x0044
	__IO uint32_t GPIO9_STATUS;	// off 0x0048
	__IO uint32_t GPIO9_CTRL;	// off 0x004c
	__IO uint32_t GPIO10_STATUS;	// off 0x0050
	__IO uint32_t GPIO10_CTRL;	// off 0x0054
	__IO uint32_t GPIO11_STATUS;	// off 0x0058
	__IO uint32_t GPIO11_CTRL;	// off 0x005c
	__IO uint32_t GPIO12_STATUS;	// off 0x0060
	__IO uint32_t GPIO12_CTRL;	// off 0x0064
	__IO uint32_t GPIO13_STATUS;	// off 0x0068
	__IO uint32_t GPIO13_CTRL;	// off 0x006c
	__IO uint32_t GPIO14_STATUS;	// off 0x0070
	__IO uint32_t GPIO14_CTRL;	// off 0x0074
	__IO uint32_t GPIO15_STATUS;	// off 0x0078
	__IO uint32_t GPIO15_CTRL;	// off 0x007c
	__IO uint32_t GPIO16_STATUS;	// off 0x0080
	__IO uint32_t GPIO16_CTRL;	// off 0x0084
	__IO uint32_t GPIO17_STATUS;	// off 0x0088
	__IO uint32_t GPIO17_CTRL;	// off 0x008c
	__IO uint32_t GPIO18_STATUS;	// off 0x0090
	__IO uint32_t GPIO18_CTRL;	// off 0x0094
	__IO uint32_t GPIO19_STATUS;	// off 0x0098
	__IO uint32_t GPIO19_CTRL;	// off 0x009c
	__IO uint32_t GPIO20_STATUS;	// off 0x00a0
	__IO uint32_t GPIO20_CTRL;	// off 0x00a4
	__IO uint32_t GPIO21_STATUS;	// off 0x00a8
	__IO uint32_t GPIO21_CTRL;	// off 0x00ac
	__IO uint32_t GPIO22_STATUS;	// off 0x00b0
	__IO uint32_t GPIO22_CTRL;	// off 0x00b4
	__IO uint32_t GPIO23_STATUS;	// off 0x00b8
	__IO uint32_t GPIO23_CTRL;	// off 0x00bc
	__IO uint32_t GPIO24_STATUS;	// off 0x00c0
	__IO uint32_t GPIO24_CTRL;	// off 0x00c4
	__IO uint32_t GPIO25_STATUS;	// off 0x00c8
	__IO uint32_t GPIO25_CTRL;	// off 0x00cc
	__IO uint32_t GPIO26_STATUS;	// off 0x00d0
	__IO uint32_t GPIO26_CTRL;	// off 0x00d4
	__IO uint32_t GPIO27_STATUS;	// off 0x00d8
	__IO uint32_t GPIO27_CTRL;	// off 0x00dc
	__IO uint32_t GPIO28_STATUS;	// off 0x00e0
	__IO uint32_t GPIO28_CTRL;	// off 0x00e4
	__IO uint32_t GPIO29_STATUS;	// off 0x00e8
	__IO uint32_t GPIO29_CTRL;	// off 0x00ec
	__IO uint32_t INTR0;	// off 0x00f0
	__IO uint32_t INTR1;	// off 0x00f4
	__IO uint32_t INTR2;	// off 0x00f8
	__IO uint32_t INTR3;	// off 0x00fc
	__IO uint32_t PROC0_INTE0;	// off 0x0100
	__IO uint32_t PROC0_INTE1;	// off 0x0104
	__IO uint32_t PROC0_INTE2;	// off 0x0108
	__IO uint32_t PROC0_INTE3;	// off 0x010c
	__IO uint32_t PROC0_INTF0;	// off 0x0110
	__IO uint32_t PROC0_INTF1;	// off 0x0114
	__IO uint32_t PROC0_INTF2;	// off 0x0118
	__IO uint32_t PROC0_INTF3;	// off 0x011c
	__IO uint32_t PROC0_INTS0;	// off 0x0120
	__IO uint32_t PROC0_INTS1;	// off 0x0124
	__IO uint32_t PROC0_INTS2;	// off 0x0128
	__IO uint32_t PROC0_INTS3;	// off 0x012c
	__IO uint32_t PROC1_INTE0;	// off 0x0130
	__IO uint32_t PROC1_INTE1;	// off 0x0134
	__IO uint32_t PROC1_INTE2;	// off 0x0138
	__IO uint32_t PROC1_INTE3;	// off 0x013c
	__IO uint32_t PROC1_INTF0;	// off 0x0140
	__IO uint32_t PROC1_INTF1;	// off 0x0144
	__IO uint32_t PROC1_INTF2;	// off 0x0148
	__IO uint32_t PROC1_INTF3;	// off 0x014c
	__IO uint32_t PROC1_INTS0;	// off 0x0150
	__IO uint32_t PROC1_INTS1;	// off 0x0154
	__IO uint32_t PROC1_INTS2;	// off 0x0158
	__IO uint32_t PROC1_INTS3;	// off 0x015c
	__IO uint32_t DORMANT_WAKE_INTE0;	// off 0x0160
	__IO uint32_t DORMANT_WAKE_INTE1;	// off 0x0164
	__IO uint32_t DORMANT_WAKE_INTE2;	// off 0x0168
	__IO uint32_t DORMANT_WAKE_INTE3;	// off 0x016c
	__IO uint32_t DORMANT_WAKE_INTF0;	// off 0x0170
	__IO uint32_t DORMANT_WAKE_INTF1;	// off 0x0174
	__IO uint32_t DORMANT_WAKE_INTF2;	// off 0x0178
	__IO uint32_t DORMANT_WAKE_INTF3;	// off 0x017c
	__IO uint32_t DORMANT_WAKE_INTS0;	// off 0x0180
	__IO uint32_t DORMANT_WAKE_INTS1;	// off 0x0184
	__IO uint32_t DORMANT_WAKE_INTS2;	// off 0x0188
	__IO uint32_t DORMANT_WAKE_INTS3;	// off 0x018c
} IO_BANK0_TypeDef;
#define IO_BANK0_BASE 0x40014000
#define IO_BANK0 ((IO_BANK0_TypeDef *) IO_BANK0_BASE)

typedef struct
{
	__IO uint32_t GPIO_QSPI_SCLK_STATUS;	// off 0x0000
	__IO uint32_t GPIO_QSPI_SCLK_CTRL;	// off 0x0004
	__IO uint32_t GPIO_QSPI_SS_STATUS;	// off 0x0008
	__IO uint32_t GPIO_QSPI_SS_CTRL;	// off 0x000c
	__IO uint32_t GPIO_QSPI_SD0_STATUS;	// off 0x0010
	__IO uint32_t GPIO_QSPI_SD0_CTRL;	// off 0x0014
	__IO uint32_t GPIO_QSPI_SD1_STATUS;	// off 0x0018
	__IO uint32_t GPIO_QSPI_SD1_CTRL;	// off 0x001c
	__IO uint32_t GPIO_QSPI_SD2_STATUS;	// off 0x0020
	__IO uint32_t GPIO_QSPI_SD2_CTRL;	// off 0x0024
	__IO uint32_t GPIO_QSPI_SD3_STATUS;	// off 0x0028
	__IO uint32_t GPIO_QSPI_SD3_CTRL;	// off 0x002c
	__IO uint32_t INTR;	// off 0x0030
	__IO uint32_t PROC0_INTE;	// off 0x0034
	__IO uint32_t PROC0_INTF;	// off 0x0038
	__IO uint32_t PROC0_INTS;	// off 0x003c
	__IO uint32_t PROC1_INTE;	// off 0x0040
	__IO uint32_t PROC1_INTF;	// off 0x0044
	__IO uint32_t PROC1_INTS;	// off 0x0048
	__IO uint32_t DORMANT_WAKE_INTE;	// off 0x004c
	__IO uint32_t DORMANT_WAKE_INTF;	// off 0x0050
	__IO uint32_t DORMANT_WAKE_INTS;	// off 0x0054
} IO_QSPI_TypeDef;
#define IO_QSPI_BASE 0x40018000
#define IO_QSPI ((IO_QSPI_TypeDef *) IO_QSPI_BASE)

typedef struct
{
	__IO uint32_t VOLTAGE_SELECT;	// off 0x0000
	__IO uint32_t GPIO0;	// off 0x0004
	__IO uint32_t GPIO1;	// off 0x0008
	__IO uint32_t GPIO2;	// off 0x000c
	__IO uint32_t GPIO3;	// off 0x0010
	__IO uint32_t GPIO4;	// off 0x0014
	__IO uint32_t GPIO5;	// off 0x0018
	__IO uint32_t GPIO6;	// off 0x001c
	__IO uint32_t GPIO7;	// off 0x0020
	__IO uint32_t GPIO8;	// off 0x0024
	__IO uint32_t GPIO9;	// off 0x0028
	__IO uint32_t GPIO10;	// off 0x002c
	__IO uint32_t GPIO11;	// off 0x0030
	__IO uint32_t GPIO12;	// off 0x0034
	__IO uint32_t GPIO13;	// off 0x0038
	__IO uint32_t GPIO14;	// off 0x003c
	__IO uint32_t GPIO15;	// off 0x0040
	__IO uint32_t GPIO16;	// off 0x0044
	__IO uint32_t GPIO17;	// off 0x0048
	__IO uint32_t GPIO18;	// off 0x004c
	__IO uint32_t GPIO19;	// off 0x0050
	__IO uint32_t GPIO20;	// off 0x0054
	__IO uint32_t GPIO21;	// off 0x0058
	__IO uint32_t GPIO22;	// off 0x005c
	__IO uint32_t GPIO23;	// off 0x0060
	__IO uint32_t GPIO24;	// off 0x0064
	__IO uint32_t GPIO25;	// off 0x0068
	__IO uint32_t GPIO26;	// off 0x006c
	__IO uint32_t GPIO27;	// off 0x0070
	__IO uint32_t GPIO28;	// off 0x0074
	__IO uint32_t GPIO29;	// off 0x0078
	__IO uint32_t SWCLK;	// off 0x007c
	__IO uint32_t SWD;	// off 0x0080
} PADS_BANK0_TypeDef;
