ashleyjwood/CC2511/Lab04/rp2040-cmsis-1.h
#define PADS_BANK0_BASE 0x4001c000
#define PADS_BANK0 ((PADS_BANK0_TypeDef *) PADS_BANK0_BASE)

typedef struct
{
	__IO uint32_t VOLTAGE_SELECT;	// off 0x0000
	__IO uint32_t GPIO_QSPI_SCLK;	// off 0x0004
	__IO uint32_t GPIO_QSPI_SD0;	// off 0x0008
	__IO uint32_t GPIO_QSPI_SD1;	// off 0x000c
	__IO uint32_t GPIO_QSPI_SD2;	// off 0x0010
	__IO uint32_t GPIO_QSPI_SD3;	// off 0x0014
	__IO uint32_t GPIO_QSPI_SS;	// off 0x0018
} PADS_QSPI_TypeDef;
#define PADS_QSPI_BASE 0x40020000
#define PADS_QSPI ((PADS_QSPI_TypeDef *) PADS_QSPI_BASE)

typedef struct
{
	__IO uint32_t CTRL;	// off 0x0000
	__IO uint32_t STATUS;	// off 0x0004
	__IO uint32_t DORMANT;	// off 0x0008
	__IO uint32_t STARTUP;	// off 0x000c
	__IO uint32_t _pad0[3]; 
	__IO uint32_t COUNT;	// off 0x001c
} XOSC_TypeDef;
#define XOSC_BASE 0x40024000
#define XOSC ((XOSC_TypeDef *) XOSC_BASE)

typedef struct
{
	__IO uint32_t CS;	// off 0x0000
	__IO uint32_t PWR;	// off 0x0004
	__IO uint32_t FBDIV_INT;	// off 0x0008
	__IO uint32_t PRIM;	// off 0x000c
} PLL_SYS_TypeDef;
#define PLL_SYS_BASE 0x40028000
#define PLL_SYS ((PLL_SYS_TypeDef *) PLL_SYS_BASE)

#define PLL_USB_BASE 0x4002c000
#define PLL_USB ((PLL_USB_TypeDef *) PLL_USB_BASE)

typedef struct
{
	__IO uint32_t BUS_PRIORITY;	// off 0x0000
	__IO uint32_t BUS_PRIORITY_ACK;	// off 0x0004
	__IO uint32_t PERFCTR0;	// off 0x0008
	__IO uint32_t PERFSEL0;	// off 0x000c
	__IO uint32_t PERFCTR1;	// off 0x0010
	__IO uint32_t PERFSEL1;	// off 0x0014
	__IO uint32_t PERFCTR2;	// off 0x0018
	__IO uint32_t PERFSEL2;	// off 0x001c
	__IO uint32_t PERFCTR3;	// off 0x0020
	__IO uint32_t PERFSEL3;	// off 0x0024
} BUSCTRL_TypeDef;
#define BUSCTRL_BASE 0x40030000
#define BUSCTRL ((BUSCTRL_TypeDef *) BUSCTRL_BASE)

typedef struct
{
	__IO uint32_t UARTDR;	// off 0x0000
	__IO uint32_t UARTRSR;	// off 0x0004
	__IO uint32_t _pad0[4]; 
	__IO uint32_t UARTFR;	// off 0x0018
	__IO uint32_t _pad1; 
	__IO uint32_t UARTILPR;	// off 0x0020
	__IO uint32_t UARTIBRD;	// off 0x0024
	__IO uint32_t UARTFBRD;	// off 0x0028
	__IO uint32_t UARTLCR_H;	// off 0x002c
	__IO uint32_t UARTCR;	// off 0x0030
	__IO uint32_t UARTIFLS;	// off 0x0034
	__IO uint32_t UARTIMSC;	// off 0x0038
	__IO uint32_t UARTRIS;	// off 0x003c
	__IO uint32_t UARTMIS;	// off 0x0040
	__IO uint32_t UARTICR;	// off 0x0044
	__IO uint32_t UARTDMACR;	// off 0x0048
	__IO uint32_t _pad2[997]; 
	__IO uint32_t UARTPERIPHID0;	// off 0x0fe0
	__IO uint32_t UARTPERIPHID1;	// off 0x0fe4
	__IO uint32_t UARTPERIPHID2;	// off 0x0fe8
	__IO uint32_t UARTPERIPHID3;	// off 0x0fec
	__IO uint32_t UARTPCELLID0;	// off 0x0ff0
	__IO uint32_t UARTPCELLID1;	// off 0x0ff4
	__IO uint32_t UARTPCELLID2;	// off 0x0ff8
	__IO uint32_t UARTPCELLID3;	// off 0x0ffc
} UART_TypeDef;
#define UART0_BASE 0x40034000
#define UART0 ((UART_TypeDef *) UART0_BASE)

#define UART1_BASE 0x40038000
#define UART1 ((UART_TypeDef *) UART1_BASE)

typedef struct
{
	__IO uint32_t SSPCR0;	// off 0x0000
	__IO uint32_t SSPCR1;	// off 0x0004
	__IO uint32_t SSPDR;	// off 0x0008
	__IO uint32_t SSPSR;	// off 0x000c
	__IO uint32_t SSPCPSR;	// off 0x0010
	__IO uint32_t SSPIMSC;	// off 0x0014
	__IO uint32_t SSPRIS;	// off 0x0018
	__IO uint32_t SSPMIS;	// off 0x001c
	__IO uint32_t SSPICR;	// off 0x0020
	__IO uint32_t SSPDMACR;	// off 0x0024
	__IO uint32_t _pad0[1006]; 
	__IO uint32_t SSPPERIPHID0;	// off 0x0fe0
	__IO uint32_t SSPPERIPHID1;	// off 0x0fe4
	__IO uint32_t SSPPERIPHID2;	// off 0x0fe8
	__IO uint32_t SSPPERIPHID3;	// off 0x0fec
	__IO uint32_t SSPPCELLID0;	// off 0x0ff0
	__IO uint32_t SSPPCELLID1;	// off 0x0ff4
	__IO uint32_t SSPPCELLID2;	// off 0x0ff8
	__IO uint32_t SSPPCELLID3;	// off 0x0ffc
} SPI_TypeDef;
#define SPI0_BASE 0x4003c000
#define SPI0 ((SPI_TypeDef *) SPI0_BASE)

#define SPI1_BASE 0x40040000
#define SPI1 ((SPI_TypeDef *) SPI1_BASE)

typedef struct
{
	__IO uint32_t IC_CON;	// off 0x0000
	__IO uint32_t IC_TAR;	// off 0x0004
	__IO uint32_t IC_SAR;	// off 0x0008
	__IO uint32_t _pad0; 
	__IO uint32_t IC_DATA_CMD;	// off 0x0010
	__IO uint32_t IC_SS_SCL_HCNT;	// off 0x0014
	__IO uint32_t IC_SS_SCL_LCNT;	// off 0x0018
	__IO uint32_t IC_FS_SCL_HCNT;	// off 0x001c
	__IO uint32_t IC_FS_SCL_LCNT;	// off 0x0020
	__IO uint32_t _pad1[2]; 
	__IO uint32_t IC_INTR_STAT;	// off 0x002c
	__IO uint32_t IC_INTR_MASK;	// off 0x0030
	__IO uint32_t IC_RAW_INTR_STAT;	// off 0x0034
	__IO uint32_t IC_RX_TL;	// off 0x0038
	__IO uint32_t IC_TX_TL;	// off 0x003c
	__IO uint32_t IC_CLR_INTR;	// off 0x0040
	__IO uint32_t IC_CLR_RX_UNDER;	// off 0x0044
	__IO uint32_t IC_CLR_RX_OVER;	// off 0x0048
	__IO uint32_t IC_CLR_TX_OVER;	// off 0x004c
	__IO uint32_t IC_CLR_RD_REQ;	// off 0x0050
	__IO uint32_t IC_CLR_TX_ABRT;	// off 0x0054
	__IO uint32_t IC_CLR_RX_DONE;	// off 0x0058
	__IO uint32_t IC_CLR_ACTIVITY;	// off 0x005c
	__IO uint32_t IC_CLR_STOP_DET;	// off 0x0060
	__IO uint32_t IC_CLR_START_DET;	// off 0x0064
	__IO uint32_t IC_CLR_GEN_CALL;	// off 0x0068
	__IO uint32_t IC_ENABLE;	// off 0x006c
	__IO uint32_t IC_STATUS;	// off 0x0070
	__IO uint32_t IC_TXFLR;	// off 0x0074
	__IO uint32_t IC_RXFLR;	// off 0x0078
	__IO uint32_t IC_SDA_HOLD;	// off 0x007c
	__IO uint32_t IC_TX_ABRT_SOURCE;	// off 0x0080
	__IO uint32_t IC_SLV_DATA_NACK_ONLY;	// off 0x0084
	__IO uint32_t IC_DMA_CR;	// off 0x0088
	__IO uint32_t IC_DMA_TDLR;	// off 0x008c
	__IO uint32_t IC_DMA_RDLR;	// off 0x0090
	__IO uint32_t IC_SDA_SETUP;	// off 0x0094
	__IO uint32_t IC_ACK_GENERAL_CALL;	// off 0x0098
	__IO uint32_t IC_ENABLE_STATUS;	// off 0x009c
	__IO uint32_t IC_FS_SPKLEN;	// off 0x00a0
	__IO uint32_t _pad2; 
	__IO uint32_t IC_CLR_RESTART_DET;	// off 0x00a8
	__IO uint32_t _pad3[18]; 
	__IO uint32_t IC_COMP_PARAM_1;	// off 0x00f4
	__IO uint32_t IC_COMP_VERSION;	// off 0x00f8
	__IO uint32_t IC_COMP_TYPE;	// off 0x00fc
} I2C_TypeDef;
#define I2C0_BASE 0x40044000
#define I2C0 ((I2C_TypeDef *) I2C0_BASE)

#define I2C1_BASE 0x40048000
#define I2C1 ((I2C_TypeDef *) I2C1_BASE)

typedef struct
{
	__IO uint32_t CS;	// off 0x0000
	__IO uint32_t RESULT;	// off 0x0004
	__IO uint32_t FCS;	// off 0x0008
	__IO uint32_t FIFO;	// off 0x000c
	__IO uint32_t DIV;	// off 0x0010
	__IO uint32_t INTR;	// off 0x0014
	__IO uint32_t INTE;	// off 0x0018
	__IO uint32_t INTF;	// off 0x001c
	__IO uint32_t INTS;	// off 0x0020
} ADC_TypeDef;
#define ADC_BASE 0x4004c000
#define ADC ((ADC_TypeDef *) ADC_BASE)

typedef struct
{
	__IO uint32_t CH0_CSR;	// off 0x0000
	__IO uint32_t CH0_DIV;	// off 0x0004
	__IO uint32_t CH0_CTR;	// off 0x0008
	__IO uint32_t CH0_CC;	// off 0x000c
	__IO uint32_t CH0_TOP;	// off 0x0010
	__IO uint32_t CH1_CSR;	// off 0x0014
	__IO uint32_t CH1_DIV;	// off 0x0018
	__IO uint32_t CH1_CTR;	// off 0x001c
	__IO uint32_t CH1_CC;	// off 0x0020
	__IO uint32_t CH1_TOP;	// off 0x0024
	__IO uint32_t CH2_CSR;	// off 0x0028
	__IO uint32_t CH2_DIV;	// off 0x002c
	__IO uint32_t CH2_CTR;	// off 0x0030
	__IO uint32_t CH2_CC;	// off 0x0034
	__IO uint32_t CH2_TOP;	// off 0x0038
	__IO uint32_t CH3_CSR;	// off 0x003c
	__IO uint32_t CH3_DIV;	// off 0x0040
	__IO uint32_t CH3_CTR;	// off 0x0044
	__IO uint32_t CH3_CC;	// off 0x0048
	__IO uint32_t CH3_TOP;	// off 0x004c
	__IO uint32_t CH4_CSR;	// off 0x0050
	__IO uint32_t CH4_DIV;	// off 0x0054
	__IO uint32_t CH4_CTR;	// off 0x0058
	__IO uint32_t CH4_CC;	// off 0x005c
	__IO uint32_t CH4_TOP;	// off 0x0060
	__IO uint32_t CH5_CSR;	// off 0x0064
	__IO uint32_t CH5_DIV;	// off 0x0068
	__IO uint32_t CH5_CTR;	// off 0x006c
	__IO uint32_t CH5_CC;	// off 0x0070
	__IO uint32_t CH5_TOP;	// off 0x0074
	__IO uint32_t CH6_CSR;	// off 0x0078
	__IO uint32_t CH6_DIV;	// off 0x007c
	__IO uint32_t CH6_CTR;	// off 0x0080
	__IO uint32_t CH6_CC;	// off 0x0084
	__IO uint32_t CH6_TOP;	// off 0x0088
	__IO uint32_t CH7_CSR;	// off 0x008c
	__IO uint32_t CH7_DIV;	// off 0x0090
	__IO uint32_t CH7_CTR;	// off 0x0094
	__IO uint32_t CH7_CC;	// off 0x0098
	__IO uint32_t CH7_TOP;	// off 0x009c
	__IO uint32_t EN;	// off 0x00a0
	__IO uint32_t INTR;	// off 0x00a4
	__IO uint32_t INTE;	// off 0x00a8
	__IO uint32_t INTF;	// off 0x00ac
	__IO uint32_t INTS;	// off 0x00b0
} PWM_TypeDef;
