ashleyjwood/CC2511/Lab04/rp2040-cmsis-1.h
#define PWM_BASE 0x40050000
#define PWM ((PWM_TypeDef *) PWM_BASE)

typedef struct
{
	__IO uint32_t TIMEHW;	// off 0x0000
	__IO uint32_t TIMELW;	// off 0x0004
	__IO uint32_t TIMEHR;	// off 0x0008
	__IO uint32_t TIMELR;	// off 0x000c
	__IO uint32_t ALARM0;	// off 0x0010
	__IO uint32_t ALARM1;	// off 0x0014
	__IO uint32_t ALARM2;	// off 0x0018
	__IO uint32_t ALARM3;	// off 0x001c
	__IO uint32_t ARMED;	// off 0x0020
	__IO uint32_t TIMERAWH;	// off 0x0024
	__IO uint32_t TIMERAWL;	// off 0x0028
	__IO uint32_t DBGPAUSE;	// off 0x002c
	__IO uint32_t PAUSE;	// off 0x0030
	__IO uint32_t INTR;	// off 0x0034
	__IO uint32_t INTE;	// off 0x0038
	__IO uint32_t INTF;	// off 0x003c
	__IO uint32_t INTS;	// off 0x0040
} TIMER_TypeDef;
#define TIMER_BASE 0x40054000
#define TIMER ((TIMER_TypeDef *) TIMER_BASE)

typedef struct
{
	__IO uint32_t CTRL;	// off 0x0000
	__IO uint32_t LOAD;	// off 0x0004
	__IO uint32_t REASON;	// off 0x0008
	__IO uint32_t SCRATCH0;	// off 0x000c
	__IO uint32_t SCRATCH1;	// off 0x0010
	__IO uint32_t SCRATCH2;	// off 0x0014
	__IO uint32_t SCRATCH3;	// off 0x0018
	__IO uint32_t SCRATCH4;	// off 0x001c
	__IO uint32_t SCRATCH5;	// off 0x0020
	__IO uint32_t SCRATCH6;	// off 0x0024
	__IO uint32_t SCRATCH7;	// off 0x0028
	__IO uint32_t TICK;	// off 0x002c
} WATCHDOG_TypeDef;
#define WATCHDOG_BASE 0x40058000
#define WATCHDOG ((WATCHDOG_TypeDef *) WATCHDOG_BASE)

typedef struct
{
	__IO uint32_t CLKDIV_M1;	// off 0x0000
	__IO uint32_t SETUP_0;	// off 0x0004
	__IO uint32_t SETUP_1;	// off 0x0008
	__IO uint32_t CTRL;	// off 0x000c
	__IO uint32_t IRQ_SETUP_0;	// off 0x0010
	__IO uint32_t IRQ_SETUP_1;	// off 0x0014
	__IO uint32_t RTC_1;	// off 0x0018
	__IO uint32_t RTC_0;	// off 0x001c
	__IO uint32_t INTR;	// off 0x0020
	__IO uint32_t INTE;	// off 0x0024
	__IO uint32_t INTF;	// off 0x0028
	__IO uint32_t INTS;	// off 0x002c
} RTC_TypeDef;
#define RTC_BASE 0x4005c000
#define RTC ((RTC_TypeDef *) RTC_BASE)

typedef struct
{
	__IO uint32_t CTRL;	// off 0x0000
	__IO uint32_t FREQA;	// off 0x0004
	__IO uint32_t FREQB;	// off 0x0008
	__IO uint32_t DORMANT;	// off 0x000c
	__IO uint32_t DIV;	// off 0x0010
	__IO uint32_t PHASE;	// off 0x0014
	__IO uint32_t STATUS;	// off 0x0018
	__IO uint32_t RANDOMBIT;	// off 0x001c
	__IO uint32_t COUNT;	// off 0x0020
} ROSC_TypeDef;
#define ROSC_BASE 0x40060000
#define ROSC ((ROSC_TypeDef *) ROSC_BASE)

typedef struct
{
	__IO uint32_t VREG;	// off 0x0000
	__IO uint32_t BOD;	// off 0x0004
	__IO uint32_t CHIP_RESET;	// off 0x0008
} VREG_AND_CHIP_RESET_TypeDef;
#define VREG_AND_CHIP_RESET_BASE 0x40064000
#define VREG_AND_CHIP_RESET ((VREG_AND_CHIP_RESET_TypeDef *) VREG_AND_CHIP_RESET_BASE)

typedef struct
{
} TBMAN_TypeDef;
#define TBMAN_BASE 0x4006c000
#define TBMAN ((TBMAN_TypeDef *) TBMAN_BASE)

typedef struct
{
	__IO uint32_t CH0_READ_ADDR;	// off 0x0000
	__IO uint32_t CH0_WRITE_ADDR;	// off 0x0004
	__IO uint32_t CH0_TRANS_COUNT;	// off 0x0008
	__IO uint32_t CH0_CTRL_TRIG;	// off 0x000c
	__IO uint32_t CH0_AL1_CTRL;	// off 0x0010
	__IO uint32_t CH0_AL1_READ_ADDR;	// off 0x0014
	__IO uint32_t CH0_AL1_WRITE_ADDR;	// off 0x0018
	__IO uint32_t CH0_AL1_TRANS_COUNT_TRIG;	// off 0x001c
	__IO uint32_t CH0_AL2_CTRL;	// off 0x0020
	__IO uint32_t CH0_AL2_TRANS_COUNT;	// off 0x0024
	__IO uint32_t CH0_AL2_READ_ADDR;	// off 0x0028
	__IO uint32_t CH0_AL2_WRITE_ADDR_TRIG;	// off 0x002c
	__IO uint32_t CH0_AL3_CTRL;	// off 0x0030
	__IO uint32_t CH0_AL3_WRITE_ADDR;	// off 0x0034
	__IO uint32_t CH0_AL3_TRANS_COUNT;	// off 0x0038
	__IO uint32_t CH0_AL3_READ_ADDR_TRIG;	// off 0x003c
	__IO uint32_t CH1_READ_ADDR;	// off 0x0040
	__IO uint32_t CH1_WRITE_ADDR;	// off 0x0044
	__IO uint32_t CH1_TRANS_COUNT;	// off 0x0048
	__IO uint32_t CH1_CTRL_TRIG;	// off 0x004c
	__IO uint32_t CH1_AL1_CTRL;	// off 0x0050
	__IO uint32_t CH1_AL1_READ_ADDR;	// off 0x0054
	__IO uint32_t CH1_AL1_WRITE_ADDR;	// off 0x0058
	__IO uint32_t CH1_AL1_TRANS_COUNT_TRIG;	// off 0x005c
	__IO uint32_t CH1_AL2_CTRL;	// off 0x0060
	__IO uint32_t CH1_AL2_TRANS_COUNT;	// off 0x0064
	__IO uint32_t CH1_AL2_READ_ADDR;	// off 0x0068
	__IO uint32_t CH1_AL2_WRITE_ADDR_TRIG;	// off 0x006c
	__IO uint32_t CH1_AL3_CTRL;	// off 0x0070
	__IO uint32_t CH1_AL3_WRITE_ADDR;	// off 0x0074
	__IO uint32_t CH1_AL3_TRANS_COUNT;	// off 0x0078
	__IO uint32_t CH1_AL3_READ_ADDR_TRIG;	// off 0x007c
	__IO uint32_t CH2_READ_ADDR;	// off 0x0080
	__IO uint32_t CH2_WRITE_ADDR;	// off 0x0084
	__IO uint32_t CH2_TRANS_COUNT;	// off 0x0088
	__IO uint32_t CH2_CTRL_TRIG;	// off 0x008c
	__IO uint32_t CH2_AL1_CTRL;	// off 0x0090
	__IO uint32_t CH2_AL1_READ_ADDR;	// off 0x0094
	__IO uint32_t CH2_AL1_WRITE_ADDR;	// off 0x0098
	__IO uint32_t CH2_AL1_TRANS_COUNT_TRIG;	// off 0x009c
	__IO uint32_t CH2_AL2_CTRL;	// off 0x00a0
	__IO uint32_t CH2_AL2_TRANS_COUNT;	// off 0x00a4
	__IO uint32_t CH2_AL2_READ_ADDR;	// off 0x00a8
	__IO uint32_t CH2_AL2_WRITE_ADDR_TRIG;	// off 0x00ac
	__IO uint32_t CH2_AL3_CTRL;	// off 0x00b0
	__IO uint32_t CH2_AL3_WRITE_ADDR;	// off 0x00b4
	__IO uint32_t CH2_AL3_TRANS_COUNT;	// off 0x00b8
	__IO uint32_t CH2_AL3_READ_ADDR_TRIG;	// off 0x00bc
	__IO uint32_t CH3_READ_ADDR;	// off 0x00c0
	__IO uint32_t CH3_WRITE_ADDR;	// off 0x00c4
	__IO uint32_t CH3_TRANS_COUNT;	// off 0x00c8
	__IO uint32_t CH3_CTRL_TRIG;	// off 0x00cc
	__IO uint32_t CH3_AL1_CTRL;	// off 0x00d0
	__IO uint32_t CH3_AL1_READ_ADDR;	// off 0x00d4
	__IO uint32_t CH3_AL1_WRITE_ADDR;	// off 0x00d8
	__IO uint32_t CH3_AL1_TRANS_COUNT_TRIG;	// off 0x00dc
	__IO uint32_t CH3_AL2_CTRL;	// off 0x00e0
	__IO uint32_t CH3_AL2_TRANS_COUNT;	// off 0x00e4
	__IO uint32_t CH3_AL2_READ_ADDR;	// off 0x00e8
	__IO uint32_t CH3_AL2_WRITE_ADDR_TRIG;	// off 0x00ec
	__IO uint32_t CH3_AL3_CTRL;	// off 0x00f0
	__IO uint32_t CH3_AL3_WRITE_ADDR;	// off 0x00f4
	__IO uint32_t CH3_AL3_TRANS_COUNT;	// off 0x00f8
	__IO uint32_t CH3_AL3_READ_ADDR_TRIG;	// off 0x00fc
	__IO uint32_t CH4_READ_ADDR;	// off 0x0100
	__IO uint32_t CH4_WRITE_ADDR;	// off 0x0104
	__IO uint32_t CH4_TRANS_COUNT;	// off 0x0108
	__IO uint32_t CH4_CTRL_TRIG;	// off 0x010c
	__IO uint32_t CH4_AL1_CTRL;	// off 0x0110
	__IO uint32_t CH4_AL1_READ_ADDR;	// off 0x0114
	__IO uint32_t CH4_AL1_WRITE_ADDR;	// off 0x0118
	__IO uint32_t CH4_AL1_TRANS_COUNT_TRIG;	// off 0x011c
	__IO uint32_t CH4_AL2_CTRL;	// off 0x0120
	__IO uint32_t CH4_AL2_TRANS_COUNT;	// off 0x0124
	__IO uint32_t CH4_AL2_READ_ADDR;	// off 0x0128
	__IO uint32_t CH4_AL2_WRITE_ADDR_TRIG;	// off 0x012c
	__IO uint32_t CH4_AL3_CTRL;	// off 0x0130
	__IO uint32_t CH4_AL3_WRITE_ADDR;	// off 0x0134
	__IO uint32_t CH4_AL3_TRANS_COUNT;	// off 0x0138
	__IO uint32_t CH4_AL3_READ_ADDR_TRIG;	// off 0x013c
	__IO uint32_t CH5_READ_ADDR;	// off 0x0140
	__IO uint32_t CH5_WRITE_ADDR;	// off 0x0144
	__IO uint32_t CH5_TRANS_COUNT;	// off 0x0148
	__IO uint32_t CH5_CTRL_TRIG;	// off 0x014c
	__IO uint32_t CH5_AL1_CTRL;	// off 0x0150
	__IO uint32_t CH5_AL1_READ_ADDR;	// off 0x0154
	__IO uint32_t CH5_AL1_WRITE_ADDR;	// off 0x0158
	__IO uint32_t CH5_AL1_TRANS_COUNT_TRIG;	// off 0x015c
	__IO uint32_t CH5_AL2_CTRL;	// off 0x0160
	__IO uint32_t CH5_AL2_TRANS_COUNT;	// off 0x0164
	__IO uint32_t CH5_AL2_READ_ADDR;	// off 0x0168
	__IO uint32_t CH5_AL2_WRITE_ADDR_TRIG;	// off 0x016c
	__IO uint32_t CH5_AL3_CTRL;	// off 0x0170
	__IO uint32_t CH5_AL3_WRITE_ADDR;	// off 0x0174
	__IO uint32_t CH5_AL3_TRANS_COUNT;	// off 0x0178
	__IO uint32_t CH5_AL3_READ_ADDR_TRIG;	// off 0x017c
	__IO uint32_t CH6_READ_ADDR;	// off 0x0180
	__IO uint32_t CH6_WRITE_ADDR;	// off 0x0184
	__IO uint32_t CH6_TRANS_COUNT;	// off 0x0188
	__IO uint32_t CH6_CTRL_TRIG;	// off 0x018c
	__IO uint32_t CH6_AL1_CTRL;	// off 0x0190
	__IO uint32_t CH6_AL1_READ_ADDR;	// off 0x0194
	__IO uint32_t CH6_AL1_WRITE_ADDR;	// off 0x0198
	__IO uint32_t CH6_AL1_TRANS_COUNT_TRIG;	// off 0x019c
	__IO uint32_t CH6_AL2_CTRL;	// off 0x01a0
	__IO uint32_t CH6_AL2_TRANS_COUNT;	// off 0x01a4
	__IO uint32_t CH6_AL2_READ_ADDR;	// off 0x01a8
	__IO uint32_t CH6_AL2_WRITE_ADDR_TRIG;	// off 0x01ac
	__IO uint32_t CH6_AL3_CTRL;	// off 0x01b0
	__IO uint32_t CH6_AL3_WRITE_ADDR;	// off 0x01b4
	__IO uint32_t CH6_AL3_TRANS_COUNT;	// off 0x01b8
	__IO uint32_t CH6_AL3_READ_ADDR_TRIG;	// off 0x01bc
	__IO uint32_t CH7_READ_ADDR;	// off 0x01c0
	__IO uint32_t CH7_WRITE_ADDR;	// off 0x01c4
	__IO uint32_t CH7_TRANS_COUNT;	// off 0x01c8
	__IO uint32_t CH7_CTRL_TRIG;	// off 0x01cc
	__IO uint32_t CH7_AL1_CTRL;	// off 0x01d0
	__IO uint32_t CH7_AL1_READ_ADDR;	// off 0x01d4
	__IO uint32_t CH7_AL1_WRITE_ADDR;	// off 0x01d8
	__IO uint32_t CH7_AL1_TRANS_COUNT_TRIG;	// off 0x01dc
	__IO uint32_t CH7_AL2_CTRL;	// off 0x01e0
	__IO uint32_t CH7_AL2_TRANS_COUNT;	// off 0x01e4
	__IO uint32_t CH7_AL2_READ_ADDR;	// off 0x01e8
	__IO uint32_t CH7_AL2_WRITE_ADDR_TRIG;	// off 0x01ec
	__IO uint32_t CH7_AL3_CTRL;	// off 0x01f0
	__IO uint32_t CH7_AL3_WRITE_ADDR;	// off 0x01f4
	__IO uint32_t CH7_AL3_TRANS_COUNT;	// off 0x01f8
	__IO uint32_t CH7_AL3_READ_ADDR_TRIG;	// off 0x01fc
	__IO uint32_t CH8_READ_ADDR;	// off 0x0200
	__IO uint32_t CH8_WRITE_ADDR;	// off 0x0204
	__IO uint32_t CH8_TRANS_COUNT;	// off 0x0208
	__IO uint32_t CH8_CTRL_TRIG;	// off 0x020c
	__IO uint32_t CH8_AL1_CTRL;	// off 0x0210
	__IO uint32_t CH8_AL1_READ_ADDR;	// off 0x0214
	__IO uint32_t CH8_AL1_WRITE_ADDR;	// off 0x0218
	__IO uint32_t CH8_AL1_TRANS_COUNT_TRIG;	// off 0x021c
	__IO uint32_t CH8_AL2_CTRL;	// off 0x0220
	__IO uint32_t CH8_AL2_TRANS_COUNT;	// off 0x0224
	__IO uint32_t CH8_AL2_READ_ADDR;	// off 0x0228
	__IO uint32_t CH8_AL2_WRITE_ADDR_TRIG;	// off 0x022c
	__IO uint32_t CH8_AL3_CTRL;	// off 0x0230
	__IO uint32_t CH8_AL3_WRITE_ADDR;	// off 0x0234
	__IO uint32_t CH8_AL3_TRANS_COUNT;	// off 0x0238
	__IO uint32_t CH8_AL3_READ_ADDR_TRIG;	// off 0x023c
	__IO uint32_t CH9_READ_ADDR;	// off 0x0240
	__IO uint32_t CH9_WRITE_ADDR;	// off 0x0244
	__IO uint32_t CH9_TRANS_COUNT;	// off 0x0248
	__IO uint32_t CH9_CTRL_TRIG;	// off 0x024c
	__IO uint32_t CH9_AL1_CTRL;	// off 0x0250
	__IO uint32_t CH9_AL1_READ_ADDR;	// off 0x0254
	__IO uint32_t CH9_AL1_WRITE_ADDR;	// off 0x0258
	__IO uint32_t CH9_AL1_TRANS_COUNT_TRIG;	// off 0x025c
	__IO uint32_t CH9_AL2_CTRL;	// off 0x0260
	__IO uint32_t CH9_AL2_TRANS_COUNT;	// off 0x0264
	__IO uint32_t CH9_AL2_READ_ADDR;	// off 0x0268
	__IO uint32_t CH9_AL2_WRITE_ADDR_TRIG;	// off 0x026c
	__IO uint32_t CH9_AL3_CTRL;	// off 0x0270
	__IO uint32_t CH9_AL3_WRITE_ADDR;	// off 0x0274
	__IO uint32_t CH9_AL3_TRANS_COUNT;	// off 0x0278
	__IO uint32_t CH9_AL3_READ_ADDR_TRIG;	// off 0x027c
	__IO uint32_t CH10_READ_ADDR;	// off 0x0280
	__IO uint32_t CH10_WRITE_ADDR;	// off 0x0284
	__IO uint32_t CH10_TRANS_COUNT;	// off 0x0288
	__IO uint32_t CH10_CTRL_TRIG;	// off 0x028c
	__IO uint32_t CH10_AL1_CTRL;	// off 0x0290
	__IO uint32_t CH10_AL1_READ_ADDR;	// off 0x0294
	__IO uint32_t CH10_AL1_WRITE_ADDR;	// off 0x0298
	__IO uint32_t CH10_AL1_TRANS_COUNT_TRIG;	// off 0x029c
	__IO uint32_t CH10_AL2_CTRL;	// off 0x02a0
	__IO uint32_t CH10_AL2_TRANS_COUNT;	// off 0x02a4
	__IO uint32_t CH10_AL2_READ_ADDR;	// off 0x02a8
	__IO uint32_t CH10_AL2_WRITE_ADDR_TRIG;	// off 0x02ac
	__IO uint32_t CH10_AL3_CTRL;	// off 0x02b0
	__IO uint32_t CH10_AL3_WRITE_ADDR;	// off 0x02b4
	__IO uint32_t CH10_AL3_TRANS_COUNT;	// off 0x02b8
	__IO uint32_t CH10_AL3_READ_ADDR_TRIG;	// off 0x02bc
	__IO uint32_t CH11_READ_ADDR;	// off 0x02c0
	__IO uint32_t CH11_WRITE_ADDR;	// off 0x02c4
	__IO uint32_t CH11_TRANS_COUNT;	// off 0x02c8
	__IO uint32_t CH11_CTRL_TRIG;	// off 0x02cc
	__IO uint32_t CH11_AL1_CTRL;	// off 0x02d0
	__IO uint32_t CH11_AL1_READ_ADDR;	// off 0x02d4
	__IO uint32_t CH11_AL1_WRITE_ADDR;	// off 0x02d8
	__IO uint32_t CH11_AL1_TRANS_COUNT_TRIG;	// off 0x02dc
	__IO uint32_t CH11_AL2_CTRL;	// off 0x02e0
	__IO uint32_t CH11_AL2_TRANS_COUNT;	// off 0x02e4
	__IO uint32_t CH11_AL2_READ_ADDR;	// off 0x02e8
	__IO uint32_t CH11_AL2_WRITE_ADDR_TRIG;	// off 0x02ec
	__IO uint32_t CH11_AL3_CTRL;	// off 0x02f0
	__IO uint32_t CH11_AL3_WRITE_ADDR;	// off 0x02f4
	__IO uint32_t CH11_AL3_TRANS_COUNT;	// off 0x02f8
	__IO uint32_t CH11_AL3_READ_ADDR_TRIG;	// off 0x02fc
	__IO uint32_t _pad0[64]; 
	__IO uint32_t INTR;	// off 0x0400
	__IO uint32_t INTE0;	// off 0x0404
	__IO uint32_t INTF0;	// off 0x0408
	__IO uint32_t INTS0;	// off 0x040c
	__IO uint32_t _pad1; 
	__IO uint32_t INTE1;	// off 0x0414
	__IO uint32_t INTF1;	// off 0x0418
	__IO uint32_t INTS1;	// off 0x041c
	__IO uint32_t TIMER0;	// off 0x0420
	__IO uint32_t TIMER1;	// off 0x0424
	__IO uint32_t TIMER2;	// off 0x0428
	__IO uint32_t TIMER3;	// off 0x042c
	__IO uint32_t MULTI_CHAN_TRIGGER;	// off 0x0430
	__IO uint32_t SNIFF_CTRL;	// off 0x0434
	__IO uint32_t SNIFF_DATA;	// off 0x0438
	__IO uint32_t _pad2; 
	__IO uint32_t FIFO_LEVELS;	// off 0x0440
	__IO uint32_t CHAN_ABORT;	// off 0x0444
	__IO uint32_t N_CHANNELS;	// off 0x0448
	__IO uint32_t _pad3[237]; 
	__IO uint32_t CH0_DBG_CTDREQ;	// off 0x0800
	__IO uint32_t CH0_DBG_TCR;	// off 0x0804
	__IO uint32_t _pad4[14]; 
	__IO uint32_t CH1_DBG_CTDREQ;	// off 0x0840
	__IO uint32_t CH1_DBG_TCR;	// off 0x0844
	__IO uint32_t _pad5[14]; 
	__IO uint32_t CH2_DBG_CTDREQ;	// off 0x0880
	__IO uint32_t CH2_DBG_TCR;	// off 0x0884
	__IO uint32_t _pad6[14]; 
	__IO uint32_t CH3_DBG_CTDREQ;	// off 0x08c0
	__IO uint32_t CH3_DBG_TCR;	// off 0x08c4
	__IO uint32_t _pad7[14]; 
	__IO uint32_t CH4_DBG_CTDREQ;	// off 0x0900
	__IO uint32_t CH4_DBG_TCR;	// off 0x0904
	__IO uint32_t _pad8[14]; 
	__IO uint32_t CH5_DBG_CTDREQ;	// off 0x0940
	__IO uint32_t CH5_DBG_TCR;	// off 0x0944
	__IO uint32_t _pad9[14]; 
	__IO uint32_t CH6_DBG_CTDREQ;	// off 0x0980
	__IO uint32_t CH6_DBG_TCR;	// off 0x0984
	__IO uint32_t _pad10[14]; 
	__IO uint32_t CH7_DBG_CTDREQ;	// off 0x09c0
	__IO uint32_t CH7_DBG_TCR;	// off 0x09c4
	__IO uint32_t _pad11[14]; 
	__IO uint32_t CH8_DBG_CTDREQ;	// off 0x0a00
	__IO uint32_t CH8_DBG_TCR;	// off 0x0a04
	__IO uint32_t _pad12[14]; 
	__IO uint32_t CH9_DBG_CTDREQ;	// off 0x0a40
	__IO uint32_t CH9_DBG_TCR;	// off 0x0a44
	__IO uint32_t _pad13[14]; 
	__IO uint32_t CH10_DBG_CTDREQ;	// off 0x0a80
	__IO uint32_t CH10_DBG_TCR;	// off 0x0a84
	__IO uint32_t _pad14[14]; 
	__IO uint32_t CH11_DBG_CTDREQ;	// off 0x0ac0
	__IO uint32_t CH11_DBG_TCR;	// off 0x0ac4
} DMA_TypeDef;
