ashleyjwood/CC2511/Lab04/rp2040-cmsis-1.h
#define DMA_BASE 0x50000000
#define DMA ((DMA_TypeDef *) DMA_BASE)

typedef struct
{
	__IO uint32_t SETUP_PACKET_LOW;	// off 0x0000
	__IO uint32_t SETUP_PACKET_HIGH;	// off 0x0004
	__IO uint32_t EP1_IN_CONTROL;	// off 0x0008
	__IO uint32_t EP1_OUT_CONTROL;	// off 0x000c
	__IO uint32_t EP2_IN_CONTROL;	// off 0x0010
	__IO uint32_t EP2_OUT_CONTROL;	// off 0x0014
	__IO uint32_t EP3_IN_CONTROL;	// off 0x0018
	__IO uint32_t EP3_OUT_CONTROL;	// off 0x001c
	__IO uint32_t EP4_IN_CONTROL;	// off 0x0020
	__IO uint32_t EP4_OUT_CONTROL;	// off 0x0024
	__IO uint32_t EP5_IN_CONTROL;	// off 0x0028
	__IO uint32_t EP5_OUT_CONTROL;	// off 0x002c
	__IO uint32_t EP6_IN_CONTROL;	// off 0x0030
	__IO uint32_t EP6_OUT_CONTROL;	// off 0x0034
	__IO uint32_t EP7_IN_CONTROL;	// off 0x0038
	__IO uint32_t EP7_OUT_CONTROL;	// off 0x003c
	__IO uint32_t EP8_IN_CONTROL;	// off 0x0040
	__IO uint32_t EP8_OUT_CONTROL;	// off 0x0044
	__IO uint32_t EP9_IN_CONTROL;	// off 0x0048
	__IO uint32_t EP9_OUT_CONTROL;	// off 0x004c
	__IO uint32_t EP10_IN_CONTROL;	// off 0x0050
	__IO uint32_t EP10_OUT_CONTROL;	// off 0x0054
	__IO uint32_t EP11_IN_CONTROL;	// off 0x0058
	__IO uint32_t EP11_OUT_CONTROL;	// off 0x005c
	__IO uint32_t EP12_IN_CONTROL;	// off 0x0060
	__IO uint32_t EP12_OUT_CONTROL;	// off 0x0064
	__IO uint32_t EP13_IN_CONTROL;	// off 0x0068
	__IO uint32_t EP13_OUT_CONTROL;	// off 0x006c
	__IO uint32_t EP14_IN_CONTROL;	// off 0x0070
	__IO uint32_t EP14_OUT_CONTROL;	// off 0x0074
	__IO uint32_t EP15_IN_CONTROL;	// off 0x0078
	__IO uint32_t EP15_OUT_CONTROL;	// off 0x007c
	__IO uint32_t EP0_IN_BUFFER_CONTROL;	// off 0x0080
	__IO uint32_t EP0_OUT_BUFFER_CONTROL;	// off 0x0084
	__IO uint32_t EP1_IN_BUFFER_CONTROL;	// off 0x0088
	__IO uint32_t EP1_OUT_BUFFER_CONTROL;	// off 0x008c
	__IO uint32_t EP2_IN_BUFFER_CONTROL;	// off 0x0090
	__IO uint32_t EP2_OUT_BUFFER_CONTROL;	// off 0x0094
	__IO uint32_t EP3_IN_BUFFER_CONTROL;	// off 0x0098
	__IO uint32_t EP3_OUT_BUFFER_CONTROL;	// off 0x009c
	__IO uint32_t EP4_IN_BUFFER_CONTROL;	// off 0x00a0
	__IO uint32_t EP4_OUT_BUFFER_CONTROL;	// off 0x00a4
	__IO uint32_t EP5_IN_BUFFER_CONTROL;	// off 0x00a8
	__IO uint32_t EP5_OUT_BUFFER_CONTROL;	// off 0x00ac
	__IO uint32_t EP6_IN_BUFFER_CONTROL;	// off 0x00b0
	__IO uint32_t EP6_OUT_BUFFER_CONTROL;	// off 0x00b4
	__IO uint32_t EP7_IN_BUFFER_CONTROL;	// off 0x00b8
	__IO uint32_t EP7_OUT_BUFFER_CONTROL;	// off 0x00bc
	__IO uint32_t EP8_IN_BUFFER_CONTROL;	// off 0x00c0
	__IO uint32_t EP8_OUT_BUFFER_CONTROL;	// off 0x00c4
	__IO uint32_t EP9_IN_BUFFER_CONTROL;	// off 0x00c8
	__IO uint32_t EP9_OUT_BUFFER_CONTROL;	// off 0x00cc
	__IO uint32_t EP10_IN_BUFFER_CONTROL;	// off 0x00d0
	__IO uint32_t EP10_OUT_BUFFER_CONTROL;	// off 0x00d4
	__IO uint32_t EP11_IN_BUFFER_CONTROL;	// off 0x00d8
	__IO uint32_t EP11_OUT_BUFFER_CONTROL;	// off 0x00dc
	__IO uint32_t EP12_IN_BUFFER_CONTROL;	// off 0x00e0
	__IO uint32_t EP12_OUT_BUFFER_CONTROL;	// off 0x00e4
	__IO uint32_t EP13_IN_BUFFER_CONTROL;	// off 0x00e8
	__IO uint32_t EP13_OUT_BUFFER_CONTROL;	// off 0x00ec
	__IO uint32_t EP14_IN_BUFFER_CONTROL;	// off 0x00f0
	__IO uint32_t EP14_OUT_BUFFER_CONTROL;	// off 0x00f4
	__IO uint32_t EP15_IN_BUFFER_CONTROL;	// off 0x00f8
	__IO uint32_t EP15_OUT_BUFFER_CONTROL;	// off 0x00fc
} USBCTRL_DPRAM_TypeDef;
#define USBCTRL_DPRAM_BASE 0x50100000
#define USBCTRL_DPRAM ((USBCTRL_DPRAM_TypeDef *) USBCTRL_DPRAM_BASE)

typedef struct
{
	__IO uint32_t ADDR_ENDP;	// off 0x0000
	__IO uint32_t ADDR_ENDP1;	// off 0x0004
	__IO uint32_t ADDR_ENDP2;	// off 0x0008
	__IO uint32_t ADDR_ENDP3;	// off 0x000c
	__IO uint32_t ADDR_ENDP4;	// off 0x0010
	__IO uint32_t ADDR_ENDP5;	// off 0x0014
	__IO uint32_t ADDR_ENDP6;	// off 0x0018
	__IO uint32_t ADDR_ENDP7;	// off 0x001c
	__IO uint32_t ADDR_ENDP8;	// off 0x0020
	__IO uint32_t ADDR_ENDP9;	// off 0x0024
	__IO uint32_t ADDR_ENDP10;	// off 0x0028
	__IO uint32_t ADDR_ENDP11;	// off 0x002c
	__IO uint32_t ADDR_ENDP12;	// off 0x0030
	__IO uint32_t ADDR_ENDP13;	// off 0x0034
	__IO uint32_t ADDR_ENDP14;	// off 0x0038
	__IO uint32_t ADDR_ENDP15;	// off 0x003c
	__IO uint32_t MAIN_CTRL;	// off 0x0040
	__IO uint32_t SOF_WR;	// off 0x0044
	__IO uint32_t SOF_RD;	// off 0x0048
	__IO uint32_t SIE_CTRL;	// off 0x004c
	__IO uint32_t SIE_STATUS;	// off 0x0050
	__IO uint32_t INT_EP_CTRL;	// off 0x0054
	__IO uint32_t BUFF_STATUS;	// off 0x0058
	__IO uint32_t BUFF_CPU_SHOULD_HANDLE;	// off 0x005c
	__IO uint32_t EP_ABORT;	// off 0x0060
	__IO uint32_t EP_ABORT_DONE;	// off 0x0064
	__IO uint32_t EP_STALL_ARM;	// off 0x0068
	__IO uint32_t NAK_POLL;	// off 0x006c
	__IO uint32_t EP_STATUS_STALL_NAK;	// off 0x0070
	__IO uint32_t USB_MUXING;	// off 0x0074
	__IO uint32_t USB_PWR;	// off 0x0078
	__IO uint32_t USBPHY_DIRECT;	// off 0x007c
	__IO uint32_t USBPHY_DIRECT_OVERRIDE;	// off 0x0080
	__IO uint32_t USBPHY_TRIM;	// off 0x0084
	__IO uint32_t _pad0; 
	__IO uint32_t INTR;	// off 0x008c
	__IO uint32_t INTE;	// off 0x0090
	__IO uint32_t INTF;	// off 0x0094
	__IO uint32_t INTS;	// off 0x0098
} USBCTRL_REGS_TypeDef;
#define USBCTRL_REGS_BASE 0x50110000
#define USBCTRL_REGS ((USBCTRL_REGS_TypeDef *) USBCTRL_REGS_BASE)

typedef struct
{
	__IO uint32_t CTRL;	// off 0x0000
	__IO uint32_t FSTAT;	// off 0x0004
	__IO uint32_t FDEBUG;	// off 0x0008
	__IO uint32_t FLEVEL;	// off 0x000c
	__IO uint32_t TXF0;	// off 0x0010
	__IO uint32_t TXF1;	// off 0x0014
	__IO uint32_t TXF2;	// off 0x0018
	__IO uint32_t TXF3;	// off 0x001c
	__IO uint32_t RXF0;	// off 0x0020
	__IO uint32_t RXF1;	// off 0x0024
	__IO uint32_t RXF2;	// off 0x0028
	__IO uint32_t RXF3;	// off 0x002c
	__IO uint32_t IRQ;	// off 0x0030
	__IO uint32_t IRQ_FORCE;	// off 0x0034
	__IO uint32_t INPUT_SYNC_BYPASS;	// off 0x0038
	__IO uint32_t DBG_PADOUT;	// off 0x003c
	__IO uint32_t DBG_PADOE;	// off 0x0040
	__IO uint32_t DBG_CFGINFO;	// off 0x0044
	__IO uint32_t INSTR_MEM0;	// off 0x0048
	__IO uint32_t INSTR_MEM1;	// off 0x004c
	__IO uint32_t INSTR_MEM2;	// off 0x0050
	__IO uint32_t INSTR_MEM3;	// off 0x0054
	__IO uint32_t INSTR_MEM4;	// off 0x0058
	__IO uint32_t INSTR_MEM5;	// off 0x005c
	__IO uint32_t INSTR_MEM6;	// off 0x0060
	__IO uint32_t INSTR_MEM7;	// off 0x0064
	__IO uint32_t INSTR_MEM8;	// off 0x0068
	__IO uint32_t INSTR_MEM9;	// off 0x006c
	__IO uint32_t INSTR_MEM10;	// off 0x0070
	__IO uint32_t INSTR_MEM11;	// off 0x0074
	__IO uint32_t INSTR_MEM12;	// off 0x0078
	__IO uint32_t INSTR_MEM13;	// off 0x007c
	__IO uint32_t INSTR_MEM14;	// off 0x0080
	__IO uint32_t INSTR_MEM15;	// off 0x0084
	__IO uint32_t INSTR_MEM16;	// off 0x0088
	__IO uint32_t INSTR_MEM17;	// off 0x008c
	__IO uint32_t INSTR_MEM18;	// off 0x0090
	__IO uint32_t INSTR_MEM19;	// off 0x0094
	__IO uint32_t INSTR_MEM20;	// off 0x0098
	__IO uint32_t INSTR_MEM21;	// off 0x009c
	__IO uint32_t INSTR_MEM22;	// off 0x00a0
	__IO uint32_t INSTR_MEM23;	// off 0x00a4
	__IO uint32_t INSTR_MEM24;	// off 0x00a8
	__IO uint32_t INSTR_MEM25;	// off 0x00ac
	__IO uint32_t INSTR_MEM26;	// off 0x00b0
	__IO uint32_t INSTR_MEM27;	// off 0x00b4
	__IO uint32_t INSTR_MEM28;	// off 0x00b8
	__IO uint32_t INSTR_MEM29;	// off 0x00bc
	__IO uint32_t INSTR_MEM30;	// off 0x00c0
	__IO uint32_t INSTR_MEM31;	// off 0x00c4
	__IO uint32_t SM0_CLKDIV;	// off 0x00c8
	__IO uint32_t SM0_EXECCTRL;	// off 0x00cc
	__IO uint32_t SM0_SHIFTCTRL;	// off 0x00d0
	__IO uint32_t SM0_ADDR;	// off 0x00d4
	__IO uint32_t SM0_INSTR;	// off 0x00d8
	__IO uint32_t SM0_PINCTRL;	// off 0x00dc
	__IO uint32_t SM1_CLKDIV;	// off 0x00e0
	__IO uint32_t SM1_EXECCTRL;	// off 0x00e4
	__IO uint32_t SM1_SHIFTCTRL;	// off 0x00e8
	__IO uint32_t SM1_ADDR;	// off 0x00ec
	__IO uint32_t SM1_INSTR;	// off 0x00f0
	__IO uint32_t SM1_PINCTRL;	// off 0x00f4
	__IO uint32_t SM2_CLKDIV;	// off 0x00f8
	__IO uint32_t SM2_EXECCTRL;	// off 0x00fc
	__IO uint32_t SM2_SHIFTCTRL;	// off 0x0100
	__IO uint32_t SM2_ADDR;	// off 0x0104
	__IO uint32_t SM2_INSTR;	// off 0x0108
	__IO uint32_t SM2_PINCTRL;	// off 0x010c
	__IO uint32_t SM3_CLKDIV;	// off 0x0110
	__IO uint32_t SM3_EXECCTRL;	// off 0x0114
	__IO uint32_t SM3_SHIFTCTRL;	// off 0x0118
	__IO uint32_t SM3_ADDR;	// off 0x011c
	__IO uint32_t SM3_INSTR;	// off 0x0120
	__IO uint32_t SM3_PINCTRL;	// off 0x0124
	__IO uint32_t INTR;	// off 0x0128
	__IO uint32_t IRQ0_INTE;	// off 0x012c
	__IO uint32_t IRQ0_INTF;	// off 0x0130
	__IO uint32_t IRQ0_INTS;	// off 0x0134
	__IO uint32_t IRQ1_INTE;	// off 0x0138
	__IO uint32_t IRQ1_INTF;	// off 0x013c
	__IO uint32_t IRQ1_INTS;	// off 0x0140
} PIO_TypeDef;
#define PIO0_BASE 0x50200000
#define PIO0 ((PIO_TypeDef *) PIO0_BASE)

