ashleyjwood/CC2511/Lab04/rp2040-cmsis-1.h
#define PIO1_BASE 0x50300000
#define PIO1 ((PIO_TypeDef *) PIO1_BASE)

typedef struct
{
	__IO uint32_t CPUID;	// off 0x0000
	__IO uint32_t GPIO_IN;	// off 0x0004
	__IO uint32_t GPIO_HI_IN;	// off 0x0008
	__IO uint32_t _pad0; 
	__IO uint32_t GPIO_OUT;	// off 0x0010
	__IO uint32_t GPIO_OUT_SET;	// off 0x0014
	__IO uint32_t GPIO_OUT_CLR;	// off 0x0018
	__IO uint32_t GPIO_OUT_XOR;	// off 0x001c
	__IO uint32_t GPIO_OE;	// off 0x0020
	__IO uint32_t GPIO_OE_SET;	// off 0x0024
	__IO uint32_t GPIO_OE_CLR;	// off 0x0028
	__IO uint32_t GPIO_OE_XOR;	// off 0x002c
	__IO uint32_t GPIO_HI_OUT;	// off 0x0030
	__IO uint32_t GPIO_HI_OUT_SET;	// off 0x0034
	__IO uint32_t GPIO_HI_OUT_CLR;	// off 0x0038
	__IO uint32_t GPIO_HI_OUT_XOR;	// off 0x003c
	__IO uint32_t GPIO_HI_OE;	// off 0x0040
	__IO uint32_t GPIO_HI_OE_SET;	// off 0x0044
	__IO uint32_t GPIO_HI_OE_CLR;	// off 0x0048
	__IO uint32_t GPIO_HI_OE_XOR;	// off 0x004c
	__IO uint32_t FIFO_ST;	// off 0x0050
	__IO uint32_t FIFO_WR;	// off 0x0054
	__IO uint32_t FIFO_RD;	// off 0x0058
	__IO uint32_t SPINLOCK_ST;	// off 0x005c
	__IO uint32_t DIV_UDIVIDEND;	// off 0x0060
	__IO uint32_t DIV_UDIVISOR;	// off 0x0064
	__IO uint32_t DIV_SDIVIDEND;	// off 0x0068
	__IO uint32_t DIV_SDIVISOR;	// off 0x006c
	__IO uint32_t DIV_QUOTIENT;	// off 0x0070
	__IO uint32_t DIV_REMAINDER;	// off 0x0074
	__IO uint32_t DIV_CSR;	// off 0x0078
	__IO uint32_t _pad1; 
	__IO uint32_t INTERP0_ACCUM0;	// off 0x0080
	__IO uint32_t INTERP0_ACCUM1;	// off 0x0084
	__IO uint32_t INTERP0_BASE0;	// off 0x0088
	__IO uint32_t INTERP0_BASE1;	// off 0x008c
	__IO uint32_t INTERP0_BASE2;	// off 0x0090
	__IO uint32_t INTERP0_POP_LANE0;	// off 0x0094
	__IO uint32_t INTERP0_POP_LANE1;	// off 0x0098
	__IO uint32_t INTERP0_POP_FULL;	// off 0x009c
	__IO uint32_t INTERP0_PEEK_LANE0;	// off 0x00a0
	__IO uint32_t INTERP0_PEEK_LANE1;	// off 0x00a4
	__IO uint32_t INTERP0_PEEK_FULL;	// off 0x00a8
	__IO uint32_t INTERP0_CTRL_LANE0;	// off 0x00ac
	__IO uint32_t INTERP0_CTRL_LANE1;	// off 0x00b0
	__IO uint32_t INTERP0_ACCUM0_ADD;	// off 0x00b4
	__IO uint32_t INTERP0_ACCUM1_ADD;	// off 0x00b8
	__IO uint32_t INTERP0_BASE_1AND0;	// off 0x00bc
	__IO uint32_t INTERP1_ACCUM0;	// off 0x00c0
	__IO uint32_t INTERP1_ACCUM1;	// off 0x00c4
	__IO uint32_t INTERP1_BASE0;	// off 0x00c8
	__IO uint32_t INTERP1_BASE1;	// off 0x00cc
	__IO uint32_t INTERP1_BASE2;	// off 0x00d0
	__IO uint32_t INTERP1_POP_LANE0;	// off 0x00d4
	__IO uint32_t INTERP1_POP_LANE1;	// off 0x00d8
	__IO uint32_t INTERP1_POP_FULL;	// off 0x00dc
	__IO uint32_t INTERP1_PEEK_LANE0;	// off 0x00e0
	__IO uint32_t INTERP1_PEEK_LANE1;	// off 0x00e4
	__IO uint32_t INTERP1_PEEK_FULL;	// off 0x00e8
	__IO uint32_t INTERP1_CTRL_LANE0;	// off 0x00ec
	__IO uint32_t INTERP1_CTRL_LANE1;	// off 0x00f0
	__IO uint32_t INTERP1_ACCUM0_ADD;	// off 0x00f4
	__IO uint32_t INTERP1_ACCUM1_ADD;	// off 0x00f8
	__IO uint32_t INTERP1_BASE_1AND0;	// off 0x00fc
	__IO uint32_t SPINLOCK0;	// off 0x0100
	__IO uint32_t SPINLOCK1;	// off 0x0104
	__IO uint32_t SPINLOCK2;	// off 0x0108
	__IO uint32_t SPINLOCK3;	// off 0x010c
	__IO uint32_t SPINLOCK4;	// off 0x0110
	__IO uint32_t SPINLOCK5;	// off 0x0114
	__IO uint32_t SPINLOCK6;	// off 0x0118
	__IO uint32_t SPINLOCK7;	// off 0x011c
	__IO uint32_t SPINLOCK8;	// off 0x0120
	__IO uint32_t SPINLOCK9;	// off 0x0124
	__IO uint32_t SPINLOCK10;	// off 0x0128
	__IO uint32_t SPINLOCK11;	// off 0x012c
	__IO uint32_t SPINLOCK12;	// off 0x0130
	__IO uint32_t SPINLOCK13;	// off 0x0134
	__IO uint32_t SPINLOCK14;	// off 0x0138
	__IO uint32_t SPINLOCK15;	// off 0x013c
	__IO uint32_t SPINLOCK16;	// off 0x0140
	__IO uint32_t SPINLOCK17;	// off 0x0144
	__IO uint32_t SPINLOCK18;	// off 0x0148
	__IO uint32_t SPINLOCK19;	// off 0x014c
	__IO uint32_t SPINLOCK20;	// off 0x0150
	__IO uint32_t SPINLOCK21;	// off 0x0154
	__IO uint32_t SPINLOCK22;	// off 0x0158
	__IO uint32_t SPINLOCK23;	// off 0x015c
	__IO uint32_t SPINLOCK24;	// off 0x0160
	__IO uint32_t SPINLOCK25;	// off 0x0164
	__IO uint32_t SPINLOCK26;	// off 0x0168
	__IO uint32_t SPINLOCK27;	// off 0x016c
	__IO uint32_t SPINLOCK28;	// off 0x0170
	__IO uint32_t SPINLOCK29;	// off 0x0174
	__IO uint32_t SPINLOCK30;	// off 0x0178
	__IO uint32_t SPINLOCK31;	// off 0x017c
} SIO_TypeDef;
#define SIO_BASE 0xd0000000
#define SIO ((SIO_TypeDef *) SIO_BASE)

typedef struct
{
	__IO uint32_t _pad0[14340]; 
	__IO uint32_t SYST_CSR;	// off 0xe010
	__IO uint32_t SYST_RVR;	// off 0xe014
	__IO uint32_t SYST_CVR;	// off 0xe018
	__IO uint32_t SYST_CALIB;	// off 0xe01c
	__IO uint32_t _pad1[56]; 
	__IO uint32_t NVIC_ISER;	// off 0xe100
	__IO uint32_t _pad2[31]; 
	__IO uint32_t NVIC_ICER;	// off 0xe180
	__IO uint32_t _pad3[31]; 
	__IO uint32_t NVIC_ISPR;	// off 0xe200
	__IO uint32_t _pad4[31]; 
	__IO uint32_t NVIC_ICPR;	// off 0xe280
	__IO uint32_t _pad5[95]; 
	__IO uint32_t NVIC_IPR0;	// off 0xe400
	__IO uint32_t NVIC_IPR1;	// off 0xe404
	__IO uint32_t NVIC_IPR2;	// off 0xe408
	__IO uint32_t NVIC_IPR3;	// off 0xe40c
	__IO uint32_t NVIC_IPR4;	// off 0xe410
	__IO uint32_t NVIC_IPR5;	// off 0xe414
	__IO uint32_t NVIC_IPR6;	// off 0xe418
	__IO uint32_t NVIC_IPR7;	// off 0xe41c
	__IO uint32_t _pad6[568]; 
	__IO uint32_t CPUID;	// off 0xed00
	__IO uint32_t ICSR;	// off 0xed04
	__IO uint32_t VTOR;	// off 0xed08
	__IO uint32_t AIRCR;	// off 0xed0c
	__IO uint32_t SCR;	// off 0xed10
	__IO uint32_t CCR;	// off 0xed14
	__IO uint32_t _pad7; 
	__IO uint32_t SHPR2;	// off 0xed1c
	__IO uint32_t SHPR3;	// off 0xed20
	__IO uint32_t SHCSR;	// off 0xed24
	__IO uint32_t _pad8[26]; 
	__IO uint32_t MPU_TYPE;	// off 0xed90
	__IO uint32_t MPU_CTRL;	// off 0xed94
	__IO uint32_t MPU_RNR;	// off 0xed98
	__IO uint32_t MPU_RBAR;	// off 0xed9c
	__IO uint32_t MPU_RASR;	// off 0xeda0
} PPB_TypeDef;
#define PPB_BASE 0xe0000000
#define PPB ((PPB_TypeDef *) PPB_BASE)
